#_*_coding:utf-8_*_
#定义商品/价格list
products = [
    ['Iphone', 5800],
    ['Ipad', 4000],
    ['Tesla', 800000],
    ['Coffee', 35],
    ['Clothes', 500],
    ['Shoes', 800]
]
#定义工资
#定义一个空的购物列表
    #循环商品价格列表，取索引与值
        #打印商品列表
        #输入想购买的商品编号
    #判断输入的是否为数字
        #如果是数字转换成int类型
        #取出商品的价格
        #判断取出的商品价格是否小于工资
            #添加选择的商品到购买商品列表
            #在工资中减掉选择商品的价格
            #打印所购买的商品和所剩余的工资
        #如果大于工资进行提示不够钱
    #判断用户输入是否为退出信号
        #打印已经选择商品
        #循环已经添加到已购商品列表中
        #打印剩余工资
        #跳出循环
